In [1]:
import psycopg2
from dotenv import load_dotenv
import os
import pandas as pd
from prettytable import PrettyTable

# Connect to db

In [2]:
%load_ext dotenv
%dotenv

In [3]:
connection = psycopg2.connect(
        host=os.getenv('DATABASE_HOST'),
        port=os.getenv('DATABASE_PORT'),
        user=os.getenv('DATABASE_USER'),
        password=os.getenv('DATABASE_PASSWORD'),
        dbname=os.getenv('DATABASE_NAME'),
    )
connection.autocommit = True
cursor = connection.cursor()

In [4]:
def select_query(query):
    cursor.execute(query)
    
    rows = cursor.fetchall()
    columns = [desc[0] for desc in cursor.description]

    # format the output nicely
    table = PrettyTable()
    table.field_names = columns
    for row in rows:
        table.add_row(row)
                      
    return table

In [5]:
def other_queries(query):
    cursor.execute(query)

# Invistigate db

![](images/Star.png)

In [8]:
query = ("""
    select * from dimDate limit 3;
""")
select_query(query)

+----------+------------+------+---------+-------+------+-----+------------+
| date_key |    date    | year | quarter | month | week | day | is_weekend |
+----------+------------+------+---------+-------+------+-----+------------+
| 20070320 | 2007-03-20 | 2007 |    1    |   3   |  12  |  20 |   False    |
| 20070129 | 2007-01-29 | 2007 |    1    |   1   |  5   |  29 |   False    |
| 20070406 | 2007-04-06 | 2007 |    2    |   4   |  14  |  6  |   False    |
+----------+------------+------+---------+-------+------+-----+------------+

In [10]:
query = ("""
    select * from dimCustomer limit 3;
""")
select_query(query)

+--------------+-------------+------------+-----------+-------------------------------------+-------------------+----------+------------+----------------+---------------+-------------+--------------+--------+---------------------+------------+------------+
| customer_key | customer_id | first_name | last_name |                email                |      address      | address2 |  district  |      city      |    country    | postal_code |    phone     | active |     create_date     | start_date |  end_date  |
+--------------+-------------+------------+-----------+-------------------------------------+-------------------+----------+------------+----------------+---------------+-------------+--------------+--------+---------------------+------------+------------+
|      1       |      1      |    MARY    |   SMITH   |    MARY.SMITH@sakilacustomer.org    |   1913 Hanoi Way  |          |  Nagasaki  |     Sasebo     |     Japan     |    35200    | 28303384290  |   1    | 2006-02-14 00:00:00 | 2024-12-04 | 2024-12-04 |
|      2       |      2      |  PATRICIA  |  JOHNSON  | PATRICIA.JOHNSON@sakilacustomer.org |  1121 Loja Avenue |          | California | San Bernardino | United States |    17886    | 838635286649 |   1    | 2006-02-14 00:00:00 | 2024-12-04 | 2024-12-04 |
|      3       |      3      |   LINDA    |  WILLIAMS |  LINDA.WILLIAMS@sakilacustomer.org  | 692 Joliet Street |          |   Attika   |    Athenai     |     Greece    |    83579    | 448477190408 |   1    | 2006-02-14 00:00:00 | 2024-12-04 | 2024-12-04 |
+--------------+-------------+------------+-----------+-------------------------------------+-------------------+----------+------------+----------------+---------------+-------------+--------------+--------+---------------------+------------+------------+

In [11]:
query = ("""
    select * from dimMovie limit 3;
""")
select_query(query)

+-----------+---------+------------------+------------------------------------------------------------------------------------------------------+--------------+----------+-------------------+-----------------+--------+--------+----------------------------------------+
| movie_key | film_id |      title       |                                             description                                              | release_year | language | original_language | rental_duration | length | rating |            special_features            |
+-----------+---------+------------------+------------------------------------------------------------------------------------------------------+--------------+----------+-------------------+-----------------+--------+--------+----------------------------------------+
|     1     |    1    | ACADEMY DINOSAUR |   A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies   |     2006     | English  |      English      |        6        |   86   |   PG   | {"Deleted Scenes","Behind the Scenes"} |
|     2     |    2    |  ACE GOLDFINGER  | A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China |     2006     | English  |      English      |        3        |   48   |   G    |      {Trailers,"Deleted Scenes"}       |
|     3     |    3    | ADAPTATION HOLES |   A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory   |     2006     | English  |      English      |        7        |   50   | NC-17  |      {Trailers,"Deleted Scenes"}       |
+-----------+---------+------------------+------------------------------------------------------------------------------------------------------+--------------+----------+-------------------+-----------------+--------+--------+----------------------------------------+

In [12]:
query = ("""
    select * from dimStore limit 3;
""")
select_query(query)

+-----------+----------+--------------------+----------+----------+------------+-----------+-------------+--------------------+-------------------+------------+------------+
| store_key | store_id |      address       | address2 | district |    city    |  country  | postal_code | manager_first_name | manager_last_name | start_date |  end_date  |
+-----------+----------+--------------------+----------+----------+------------+-----------+-------------+--------------------+-------------------+------------+------------+
|     1     |    1     | 47 MySakila Drive  |   None   | Alberta  | Lethbridge |   Canada  |             |        Mike        |      Hillyer      | 2024-12-04 | 2024-12-04 |
|     2     |    2     | 28 MySQL Boulevard |   None   |   QLD    | Woodridge  | Australia |             |        Jon         |      Stephens     | 2024-12-04 | 2024-12-04 |
+-----------+----------+--------------------+----------+----------+------------+-----------+-------------+--------------------+-------------------+------------+------------+

In [13]:
query = ("""
    select * from factSales limit 3;
""")
select_query(query)

+-----------+----------+--------------+-----------+-----------+--------------+
| sales_key | date_key | customer_key | movie_key | store_key | sales_amount |
+-----------+----------+--------------+-----------+-----------+--------------+
|     1     | 20070124 |     269      |    870    |     2     |     1.99     |
|     2     | 20070125 |     269      |    651    |     1     |     0.99     |
|     3     | 20070128 |     269      |    818    |     1     |     6.99     |
+-----------+----------+--------------+-----------+-----------+--------------+